abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include "em_device.h"
#include "oepl_nvm.h"
#include "oepl_hw_abstraction.h"
#include "oepl_flash_driver.h"
#include "oepl_efr32_hwtypes.h"

#include "oepl-proto.h"
#include "nvm3.h"
#include "nvm3_default.h"
#include "btl_interface.h"
#include "btl_interface_storage.h"
#include "md5.h"
#include <stdio.h>
#include "oepl-definitions.h"
#include "sl_udelay.h"

// -----------------------------------------------------------------------------
//                              Configuration values
// -----------------------------------------------------------------------------
#ifndef NVM_DEBUG_PRINT
#define NVM_DEBUG_PRINT 1
#endif

#define NVM3_OBJECT_ID_CONFIG               0x0000
#define NVM3_OBJECT_ID_SETTINGS_START       0x0001
#define NVM3_OBJECT_ID_SETTINGS_MAX         0x0100

#define NVM3_OBJECT_ID_FWU_METADATA         0x1000
#define NVM3_OBJECT_ID_FWU_BLOCK_COUNTER    0x1001
#define NVM3_OBJECT_ID_IMAGE_METADATA_BASE  0x2000
#define NVM3_OBJECT_ID_IMAGE_METADATA_MAX   0x2010

#define NVM3_MARKER_VALUE                   0xCAFEFACEUL

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#if NVM_DEBUG_PRINT
#define DPRINTF(fmt_, ...) oepl_hw_debugprint(DBG_NVM, (fmt_), ##__VA_ARGS__)
#else
#define DPRINTF(...)
#endif

typedef struct {
  uint32_t marker;
  uint8_t hwid;
  size_t fwu_slot_size;
  uint32_t bulk_storage_base_address;
  size_t bulk_storage_size;
  size_t bulk_storage_pagesize;
} device_hw_config_t;

typedef struct {
  uint64_t current_md5;
  uint64_t staged_md5;
  uint16_t current_version;
  uint16_t staged_version;
  size_t current_size;
  size_t staged_size;
} device_fwu_meta_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static oepl_nvm_status_t check_fwu_md5(void);
static int32_t oepl_nvm_btl_init_with_wake(void);
static bool oepl_nvm_solum_fallback_devconfig(uint8_t hwid);
static bool oepl_nvm_apply_btl_storage_layout(void);
static void oepl_nvm_reset_slot_cache(void);
static oepl_nvm_status_t oepl_nvm_ensure_bulk_storage(void);

// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
static device_hw_config_t devconfig;
const oepl_stored_tagsettings_t oepl_default_tagsettings = {
  .settingsVer = 1,                  // the version of the struct as written to the infopage
  .enableFastBoot = 0,               // default 0; if set, it will skip splashscreen
  .enableRFWake = 0,                 // default 0; if set, it will enable RF wake. This will add about ~0.9µA idle power consumption
  .enableTagRoaming = 0,             // default 0; if set, the tag will scan for an accesspoint every few check-ins. This will increase power consumption quite a bit
  .enableScanForAPAfterTimeout = 1,  // default 1; if a the tag failed to check in, after a few attempts it will try to find a an AP on other channels
  .enableLowBatSymbol = 1,           // default 1; tag will show 'low battery' icon on screen if the battery is depleted
  .enableNoRFSymbol = 1,             // default 1; tag will show 'no signal' icon on screen if it failed to check in for a longer period of time
  .fastBootCapabilities = 0,         // holds the byte with 'capabilities' as detected during a normal tag boot; allows the tag to skip detecting buttons and NFC chip
  .customMode = 0,                   // default 0; if anything else, tag will bootup in a different 'mode'
  .batLowVoltage = 2600,               // Low battery threshold voltage (2450 for 2.45v). defaults to BATTERY_VOLTAGE_MINIMUM from powermgt.h
  .minimumCheckInTime = 40,          // defaults to BASE_INTERVAL from powermgt.h
  .fixedChannel = 0,                 // default 0; if set to a valid channel number, the tag will stick to that channel
};

static oepl_stored_tagsettings_t tag_settings;
static size_t oepl_nvm_num_slots_cache = 0;
static size_t oepl_nvm_slot_size_cache = 0;

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

// ------------------------ Base NVM Layer functionality -----------------------
oepl_nvm_status_t oepl_nvm_init_default(void)
{
  // Bugfix: deinit the bootloader explicitly since it might not have realized
  bootloader_deinit();
  Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
  if(nvm_status != ECODE_NVM3_OK) {
    DPRINTF("Unable to read/find device initial settings, %08lX\n", nvm_status);
    return NVM_ERROR;
  }
  if(devconfig.marker != NVM3_MARKER_VALUE) {
    DPRINTF("Wrong version of device initial settings\n");
    return NVM_ERROR;
  }
  if(devconfig.bulk_storage_size < 4096) {
    DPRINTF("No flash registered, rerunning autodetect\n");
    nvm3_deleteObject(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG);
    return NVM_ERROR;
  }

  return NVM_SUCCESS;
}

static int32_t oepl_nvm_btl_init_with_wake(void)
{
  oepl_hw_flash_wake();
  sl_udelay_wait(50000);
  return bootloader_init();
}

static bool oepl_nvm_solum_fallback_devconfig(uint8_t hwid)
{
  const oepl_efr32xg22_tagconfig_t* tagcfg = oepl_efr32xg22_get_config();
  if(tagcfg == NULL || tagcfg->hwtype != SOLUM_AUTODETECT) {
    return false;
  }

  uint32_t jedec = 0;
  uint32_t flash_size = 0;
  if(!oepl_flash_probe(&jedec, &flash_size)) {
    DPRINTF("Solum flash probe failed\n");
    return false;
  }

  const uint32_t fwu_slot = 236UL * 1024UL;
  if(flash_size <= fwu_slot + 65536UL) {
    DPRINTF("Flash too small for OTA+bulk (%luB)\n", flash_size);
    return false;
  }

