abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
  devconfig.marker = NVM3_MARKER_VALUE;
  devconfig.hwid = hwid;
  devconfig.fwu_slot_size = fwu_slot;
  devconfig.bulk_storage_base_address = fwu_slot;
  devconfig.bulk_storage_size = flash_size - fwu_slot;
  devconfig.bulk_storage_pagesize = 4096;

  DPRINTF("Solum probe layout: flash %luB bulk %luB @%08lx page %luB\n",
          flash_size,
          (unsigned long)devconfig.bulk_storage_size,
          (unsigned long)devconfig.bulk_storage_base_address,
          (unsigned long)devconfig.bulk_storage_pagesize);
  return true;
}

static void oepl_nvm_reset_slot_cache(void)
{
  oepl_nvm_num_slots_cache = 0;
  oepl_nvm_slot_size_cache = 0;
}

static bool oepl_nvm_apply_btl_storage_layout(void)
{
  BootloaderStorageSlot_t slotInfo;
  BootloaderStorageInformation_t flashInfo;
  int32_t status;

  bootloader_getStorageInfo(&flashInfo);
  if(flashInfo.flashInfo.partSize < 4096) {
    DPRINTF("BTL flash part size too small (%ldB)\n", flashInfo.flashInfo.partSize);
    return false;
  }
  if(flashInfo.numStorageSlots > 1) {
    DPRINTF("Bootloader with multiple slots is not supported (yet)\n");
    return false;
  }
  if((status = bootloader_getStorageSlotInfo(0, &slotInfo)) != BOOTLOADER_OK) {
    DPRINTF("BTL getStorageSlotInfo failed %08lx\n", status);
    return false;
  }

  devconfig.fwu_slot_size = slotInfo.length;
  devconfig.bulk_storage_size = flashInfo.flashInfo.partSize - slotInfo.length - slotInfo.address;
  devconfig.bulk_storage_pagesize = flashInfo.flashInfo.pageSize;
  devconfig.bulk_storage_base_address = slotInfo.address + slotInfo.length;

  DPRINTF("Detected raw flash with size %ldB, page size %ldB\n",
          flashInfo.flashInfo.partSize, flashInfo.flashInfo.pageSize);
  return devconfig.bulk_storage_size >= 4096;
}

static oepl_nvm_status_t oepl_nvm_ensure_bulk_storage(void)
{
  if(devconfig.marker == NVM3_MARKER_VALUE &&
     devconfig.bulk_storage_size >= 4096 &&
     devconfig.bulk_storage_pagesize > 0) {
    return NVM_SUCCESS;
  }

  if(oepl_nvm_init_default() == NVM_SUCCESS) {
    return NVM_SUCCESS;
  }

  DPRINTF("Bulk storage missing — attempting autodetect\n");
  uint8_t hwid = oepl_efr32xg22_get_oepl_hwid();
  devconfig.marker = NVM3_MARKER_VALUE;
  devconfig.hwid = hwid;

  oepl_hw_flash_wake();
  int32_t status = oepl_nvm_btl_init_with_wake();
  if(status == BOOTLOADER_OK && oepl_nvm_apply_btl_storage_layout()) {
    Ecode_t wr = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
    bootloader_deinit();
    oepl_hw_flash_deepsleep();
    if(wr == ECODE_NVM3_OK) {
      DPRINTF("Stored devconfig from BTL autodetect\n");
      oepl_nvm_reset_slot_cache();
      return NVM_SUCCESS;
    }
    DPRINTF("Failed writing devconfig, %08lX\n", wr);
    return NVM_ERROR;
  }
  if(status == BOOTLOADER_OK) {
    bootloader_deinit();
  }

  if(oepl_nvm_solum_fallback_devconfig(hwid)) {
    Ecode_t wr = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
    oepl_hw_flash_deepsleep();
    if(wr == ECODE_NVM3_OK) {
      DPRINTF("Stored devconfig from SPI probe\n");
      oepl_nvm_reset_slot_cache();
      return NVM_SUCCESS;
    }
    DPRINTF("Failed writing probed devconfig, %08lX\n", wr);
  }

  oepl_hw_flash_deepsleep();
  return NVM_ERROR;
}

oepl_nvm_status_t oepl_nvm_factory_reset(uint8_t hwid)
{
  oepl_nvm_status_t function_status = NVM_ERROR;
  Ecode_t nvm_status = nvm3_eraseAll(nvm3_defaultHandle);
  if(nvm_status != ECODE_NVM3_OK) {
    DPRINTF("Failed resetting to factory, %08lX\n", nvm_status);
    return NVM_ERROR;
  }

  devconfig.marker = NVM3_MARKER_VALUE;
  devconfig.hwid = hwid;
  
  // Autodetect FWU and storage size through the bootloader flash driver
  int32_t status;
  BootloaderStorageSlot_t slotInfo;
  BootloaderStorageInformation_t flashInfo;

  oepl_hw_flash_wake();
  if((status = oepl_nvm_btl_init_with_wake()) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL init with %08lx\n", status);
    if(!oepl_nvm_solum_fallback_devconfig(hwid)) {
      goto exit;
    }
    nvm_status = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
    if(nvm_status != ECODE_NVM3_OK) {
      DPRINTF("Failed writing probe devconfig, %08lX\n", nvm_status);
      goto exit;
    }
    DPRINTF("Stored new devconfig (probe fallback)\n");
    oepl_nvm_reset_slot_cache();
    function_status = oepl_nvm_setting_set_default(OEPL_RAW_TAGSETTINGS);
    if(function_status == NVM_SUCCESS) {
      DPRINTF("Stored default tagconfig\n");
    }
    goto exit;
  }

  bootloader_getStorageInfo(&flashInfo);
  if(flashInfo.numStorageSlots > 1) {
    DPRINTF("Bootloader with multiple slots is not supported (yet)\n");
    status = BOOTLOADER_ERROR_INIT_STORAGE;
    goto done;
  }

  if((status = bootloader_getStorageSlotInfo(0, &slotInfo)) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL slot info with %08lx\n", status);
    goto done;
  }

  DPRINTF("Detected bootloader slot size %ldB\n", slotInfo.length);
  DPRINTF("Detected raw flash with size %ldB, page size %ldB\n", flashInfo.flashInfo.partSize, flashInfo.flashInfo.pageSize);
  DPRINTF("Wordsize %d, page erase %ldms, part erase %ldms\n", flashInfo.flashInfo.wordSizeBytes, flashInfo.flashInfo.pageEraseMs, flashInfo.flashInfo.partEraseMs);

  devconfig.fwu_slot_size = slotInfo.length;
  devconfig.bulk_storage_size = flashInfo.flashInfo.partSize - slotInfo.length - slotInfo.address;
  devconfig.bulk_storage_pagesize = flashInfo.flashInfo.pageSize;
  devconfig.bulk_storage_base_address = slotInfo.address + slotInfo.length;

  DPRINTF("Raw flash content before erase:\n");
  for(size_t i = 0; i < flashInfo.flashInfo.partSize / 32; i+=32) {
    uint8_t buffer[32];
    bootloader_readRawStorage(i, buffer, 32);
    for(size_t j = 0; j < 32; j++) {
      DPRINTF("%02x", buffer[j]);
      if(j > 0 && j % 8 == 0) {
        DPRINTF(" ");
      }
    }
    DPRINTF("\n");
  }

  // Erase the storage
  status = bootloader_eraseRawStorage(slotInfo.address, flashInfo.flashInfo.partSize);
  if(status != BOOTLOADER_OK) {
    DPRINTF("Failed flash device erase with %08lx\n", status);
  }

