abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
  return oepl_nvm_setting_set(OEPL_RAW_TAGSETTINGS, &oepl_default_tagsettings, sizeof(oepl_default_tagsettings));
}

// ------------------------ OTA upgrade functionality --------------------------
oepl_nvm_status_t oepl_fwu_erase(void)
{
  int32_t status;
  oepl_hw_flash_wake();
  if((status = bootloader_init()) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL init with %08lx\n", status);
    goto exit;
  }

  if((status = bootloader_eraseStorageSlot(0)) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL erase with %08lx\n", status);
    goto done;
  }

  oepl_nvm_status_t retval = oepl_fwu_set_metadata(0, 0, 0);

  done:
  if((status = bootloader_deinit()) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL deinit with %08lx\n", status);
  }
  exit:
  oepl_hw_flash_deepsleep();
  return retval;
}

oepl_nvm_status_t oepl_fwu_set_metadata(uint16_t new_version, uint64_t file_md5, size_t file_size)
{
  device_fwu_meta_t meta;
  nvm3_deleteObject(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_BLOCK_COUNTER);
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    meta.current_md5 = 0;
    meta.current_version = oepl_hw_get_swversion();
    meta.current_size = 0;
    meta.staged_version = new_version;
    meta.staged_md5 = file_md5;
    meta.staged_size = file_size;
    nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
    return NVM_SUCCESS;
  } else if(status == ECODE_NVM3_OK) {
    meta.staged_version = new_version;
    meta.staged_md5 = file_md5;
    meta.staged_size = file_size;
    nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
    return NVM_SUCCESS;
  } else {
    return NVM_ERROR;
  }
}

oepl_nvm_status_t oepl_fwu_get_metadata(uint16_t* new_version, uint64_t* file_md5, size_t* file_size)
{
  device_fwu_meta_t meta;
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status == ECODE_NVM3_OK) {
    *new_version = meta.staged_version;
    *file_md5 = meta.staged_md5;
    *file_size = meta.staged_size;
    return NVM_SUCCESS;
  } else if (status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    return NVM_NOT_FOUND;
  } else {
    return NVM_ERROR;
  }
}

oepl_nvm_status_t oepl_fwu_get_highest_block_written(size_t* block_idx)
{
  uint32_t counter_value;
  Ecode_t status = nvm3_readCounter(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_BLOCK_COUNTER, &counter_value);
  if(status == ECODE_NVM3_OK) {
    *block_idx = counter_value;
  } else if(status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    *block_idx = 0;
    nvm3_writeCounter(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_BLOCK_COUNTER, 0);
  } else {
    return NVM_ERROR;
  }
  return NVM_SUCCESS;
}

oepl_nvm_status_t oepl_fwu_write(size_t block_idx, const uint8_t bytes[4096], size_t actual_length)
{
  size_t highest_written;
  if(oepl_fwu_get_highest_block_written(&highest_written) != NVM_SUCCESS) {
    return NVM_ERROR;
  }

  if(actual_length > 4096) {
    return NVM_ERROR;
  }

  if(block_idx != highest_written + 1
     && block_idx != 0) {
    DPRINTF("ERR: FWU writing out of sequence block %d (written %d)\n", block_idx, highest_written);
    return NVM_ERROR;
  }
  int32_t btl_status;
  oepl_hw_flash_wake();
  if((btl_status = bootloader_init()) != BOOTLOADER_OK) {
    DPRINTF("Failed BTL init with %08lx\n", btl_status);
    oepl_hw_flash_deepsleep();
    return NVM_ERROR;
  }

  // Todo: the bootloader API somehow declares its input a mutable buffer. Does it actually modify it?
  btl_status = bootloader_writeStorage(0, block_idx * 4096, (uint8_t*)bytes, actual_length);
  bootloader_deinit();
  oepl_hw_flash_deepsleep();
  if(btl_status == BOOTLOADER_OK) {
    if(block_idx == 0) {
      nvm3_writeCounter(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_BLOCK_COUNTER, 0);
      highest_written = 0;
    } else {
      nvm3_incrementCounter(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_BLOCK_COUNTER, (uint32_t*)&highest_written);
    }

    if(block_idx != highest_written) {
      DPRINTF("Couldn't match FWU block write counter\n");
      return NVM_ERROR;
    }
    return NVM_SUCCESS;
  } else {
    DPRINTF("Failed storage write with %ld\n", btl_status);
    return NVM_ERROR;
  }
}

static uint8_t metadata[8];

void oepl_fwu_metadata_cb(uint32_t address,
                          uint8_t  *data,
                          size_t   length,
                          void     *context)
{
  (void)context;
  if(address < sizeof(metadata) &&
     (address + length <= sizeof(metadata))) {
    memcpy(&metadata[address], data, length);
  }
}

oepl_nvm_status_t oepl_fwu_check(void)
{
  // To check an FWU, we first check the staged MD5 against the content of the bootload slot
  oepl_nvm_status_t status = check_fwu_md5();
  if(status != NVM_SUCCESS) {
    return status;
  }

  // Then we let the bootloader do a file consistency check
  oepl_hw_flash_wake();
  int32_t btl_status = bootloader_init();
  if(btl_status != BOOTLOADER_OK) {
    goto exit;
  }

  memset(metadata, 0, sizeof(metadata));

  btl_status = bootloader_verifyImage(0, oepl_fwu_metadata_cb);
  if(btl_status != BOOTLOADER_OK) {
    DPRINTF("Failed image verification with %08lx\n", btl_status);
    goto done;
  }
  if(memcmp(metadata, "OEPL_UNI", 8) != 0) {
    DPRINTF("Incorrect metadata, this OTA file is not meant for this product\n");
    btl_status = BOOTLOADER_ERROR_SECURITY_REJECTED;
    goto done;
  }
  DPRINTF("Succesfully verified image in slot 0\n");
done:
  if(bootloader_deinit() != BOOTLOADER_OK) {
    DPRINTF("Failed BTL deinit with %08lx\n", btl_status);
  }
exit:
  oepl_hw_flash_deepsleep();
  if(btl_status != BOOTLOADER_OK) {
    return NVM_ERROR;
  } else {
    return NVM_SUCCESS;
  }
}

oepl_nvm_status_t oepl_fwu_apply(void)
{
  // Trigger the bootloader
  int32_t status;
  oepl_hw_flash_wake();
  if((status = bootloader_init()) != BOOTLOADER_OK) {
    DPRINTF("Failed BTL init with %08lx\n", status);
    goto exit;
  }

  // Note: this will trigger a reboot if all went well
  bootloader_rebootAndInstall();

