abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
  // If we end up here, it's an error
  DPRINTF("Fell through bootload application\n");
exit:
  if((status = bootloader_deinit()) != BOOTLOADER_OK) {
    DPRINTF("Failed BTL deinit with %08lx\n", status);
  }
  oepl_hw_flash_deepsleep();

  return NVM_ERROR;
}

bool oepl_fwu_is_upgraded(void)
{
  device_fwu_meta_t meta;
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    DPRINTF("No firmware meta data found, creating\n");
    meta.current_md5 = 0;
    meta.current_version = oepl_hw_get_swversion();
    meta.current_size = 0;
    meta.staged_version = 0;
    meta.staged_md5 = 0;
    meta.staged_size = 0;
    nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
    return false;
  } else if(status == ECODE_NVM3_OK) {
    DPRINTF("Checking current rev %d against previously stored %d\n", oepl_hw_get_swversion(), meta.current_version);
    if(oepl_hw_get_swversion() > meta.current_version) {
      // Todo: upgrade logic?
      DPRINTF("Upgrade happened\n");
      return true;
    } else if(oepl_hw_get_swversion() < meta.current_version) {
      // Todo: downgrade logic?
      DPRINTF("Downgrade happened\n");
      return true;
    } else {
      return false;
    }
  } else {
    return false;
  }
}

oepl_nvm_status_t oepl_fwu_confirm_upgrade(void)
{
  device_fwu_meta_t meta;
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status == ECODE_NVM3_OK) {
    meta.current_md5 = meta.staged_md5;
    meta.current_version = oepl_hw_get_swversion();
    meta.current_size = meta.staged_size;
    meta.staged_version = 0;
    meta.staged_md5 = 0;
    meta.staged_size = 0;
    nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
    DPRINTF("Upgrade confirmed in NVM\n");
    oepl_fwu_erase();
    return NVM_SUCCESS;
  } else {
    return NVM_ERROR;
  }
}

bool oepl_fwu_should_download(uint64_t update_md5, size_t update_filesize)
{
  device_fwu_meta_t meta;
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status == ECODE_NVM3_OK) {
    if(meta.current_md5 == update_md5 && meta.current_size == update_filesize) {
      // We're already running this file
      return false;
    } else {
      return true;
    }
  } else {
    // We don't know, let the download proceed.
    return true;
  }
}

// ------------------------ Image storage functionality ------------------------
oepl_nvm_status_t oepl_nvm_get_num_img_slots(size_t* num_slots, size_t* slot_size)
{
  if(oepl_nvm_num_slots_cache > 0) {
    *num_slots = oepl_nvm_num_slots_cache;
    *slot_size = oepl_nvm_slot_size_cache;
    return NVM_SUCCESS;
  }

  size_t xres, yres, bpp;
  bool status = oepl_hw_get_screen_properties(&xres, &yres, &bpp);
  if(!status) {
    return NVM_ERROR;
  }

  if(devconfig.bulk_storage_pagesize == 0 ||
     devconfig.bulk_storage_size == 0) {
    if(oepl_nvm_ensure_bulk_storage() != NVM_SUCCESS) {
      DPRINTF("No bulk storage configured (page=%lu size=%lu)\n",
              (unsigned long)devconfig.bulk_storage_pagesize,
              (unsigned long)devconfig.bulk_storage_size);
      return NVM_ERROR;
    }
  }

  // Calculate amount of bytes needed for this screen type
  size_t raw_framesize = xres * yres * bpp / 8;

  // Calculate least amount of page-multiple bytes needed to contain a raw image for this screen
  oepl_nvm_slot_size_cache = raw_framesize / devconfig.bulk_storage_pagesize;
  if(raw_framesize % devconfig.bulk_storage_pagesize) {
    oepl_nvm_slot_size_cache++;
  }
  oepl_nvm_slot_size_cache *= devconfig.bulk_storage_pagesize;

  // Calculate amount of times we can fit this page-aligned size in bulk storage
  oepl_nvm_num_slots_cache = devconfig.bulk_storage_size / oepl_nvm_slot_size_cache;
  if(oepl_nvm_num_slots_cache > NVM3_OBJECT_ID_IMAGE_METADATA_MAX - NVM3_OBJECT_ID_IMAGE_METADATA_BASE) {
    oepl_nvm_num_slots_cache = NVM3_OBJECT_ID_IMAGE_METADATA_MAX - NVM3_OBJECT_ID_IMAGE_METADATA_BASE;
  }

  // Output sizes
  *num_slots = oepl_nvm_num_slots_cache;
  *slot_size = oepl_nvm_slot_size_cache;
  return NVM_SUCCESS;
}

void oepl_nvm_log_image_slots(void)
{
  size_t num_slots, slot_size;
  if(oepl_nvm_get_num_img_slots(&num_slots, &slot_size) != NVM_SUCCESS) {
    DPRINTF("slot inventory: unavailable\n");
    return;
  }

  DPRINTF("slot inventory: %u slots, %u bytes each\n", (unsigned)num_slots, (unsigned)slot_size);
  for(size_t i = 0; i < num_slots; i++) {
    oepl_stored_image_hdr_t imgmeta;
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, &imgmeta, sizeof(imgmeta));
    if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      DPRINTF("  [%u] empty\n", (unsigned)i);
    } else if(nvm_status != ECODE_NVM3_OK) {
      DPRINTF("  [%u] read error\n", (unsigned)i);
    } else {
      DPRINTF("  [%u] type=0x%02x valid=%u size=%lu seq=%lu\n",
              (unsigned)i, imgmeta.image_type, imgmeta.is_valid,
              (unsigned long)imgmeta.size, (unsigned long)imgmeta.seqno);
    }
  }
}

oepl_nvm_status_t oepl_nvm_get_image_raw_address(size_t img_idx, uint32_t* address)
{
  size_t num_slots, slot_size;
  if(oepl_nvm_get_num_img_slots(&num_slots, &slot_size) != NVM_SUCCESS) {
    return NVM_ERROR;
  }

  if(devconfig.bulk_storage_pagesize == 0 ||
     devconfig.bulk_storage_size == 0) {
    // No bulk storage configured?
    return NVM_ERROR;
  }

  *address = devconfig.bulk_storage_base_address + img_idx * slot_size;
  return NVM_SUCCESS;
}

oepl_nvm_status_t oepl_nvm_get_image_by_hash(uint64_t md5, uint32_t size, size_t* img_idx, oepl_stored_image_hdr_t* metadata)
{
  DPRINTF("Looking for image with hash 0x%llx\n", md5);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  for(size_t i = 0; i < num_slots; i++) {
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, metadata, sizeof(oepl_stored_image_hdr_t));
    if(nvm_status != ECODE_NVM3_OK &&
       nvm_status != ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      return NVM_ERROR;
    }
    if(metadata->md5 == md5 && metadata->size == size) {
      *img_idx = i;
      return NVM_SUCCESS;
    }
  }

  // If we exited the for loop, we haven't found a matching image.
  return NVM_NOT_FOUND;
}

