abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
oepl_nvm_status_t oepl_nvm_get_image_by_type(uint8_t image_type, size_t* img_idx, size_t* seqno)
{
  DPRINTF("Looking for image with type 0x%x\n", image_type);
  size_t num_slots, slot_size, highest_seq = 0;
  bool found = false;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  for(size_t i = 0; i < num_slots; i++) {
    oepl_stored_image_hdr_t imgmeta;
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, &imgmeta, sizeof(imgmeta));
    if(nvm_status != ECODE_NVM3_OK &&
       nvm_status != ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      return NVM_ERROR;
    }
    if((imgmeta.image_type == image_type) && (nvm_status == ECODE_NVM3_OK)) {
      if(imgmeta.seqno >= highest_seq) {
        *img_idx = i;
        highest_seq = imgmeta.seqno;
        if(seqno != NULL) {
          *seqno = imgmeta.seqno;
        }
      }
      found = true;
      DPRINTF("Found at idx 0x%x", *img_idx);
    }
  }

  // If we exited the for loop, we haven't found a matching image.
  return found ? NVM_SUCCESS : NVM_NOT_FOUND;
}

oepl_nvm_status_t oepl_nvm_get_free_image_slot(size_t* img_idx, uint8_t image_type)
{
  size_t num_slots, slot_size, candidate_seq = 0, candidate_idx = 0;
  bool found_candidate = false;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  for(size_t i = 0; i < num_slots; i++) {
    oepl_stored_image_hdr_t imgmeta;
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, &imgmeta, sizeof(imgmeta));
    if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      // Found a free slot, use it
      DPRINTF("Image slot 0x%x unoccupied\n", i);
      *img_idx = i;
      return NVM_SUCCESS;
    } else if(nvm_status != ECODE_NVM3_OK) {
      // Hardware / application error?
      return NVM_ERROR;
    } else if(!imgmeta.is_valid) {
      // Clean up and release this slot back for use
      DPRINTF("Image slot 0x%x not made valid, freeing it for use\n", i);
      oepl_nvm_erase_image(i);
      *img_idx = i;
      return NVM_SUCCESS;
    } else {
      // If we find an image of the same type, remember the index of the
      // one with the lowest sequence number since it would be a candidate for replacement.
      if(imgmeta.image_type == image_type) {
        if(!found_candidate || imgmeta.seqno < candidate_seq) {
          candidate_seq = imgmeta.seqno;
          candidate_idx = i;
        }
        found_candidate = true;
      }
    }
  }

  if(found_candidate) {
    // Erase candidate to free up space for new one
    DPRINTF("Image of type 0x%x has oldest seq 0x%x in slot 0x%x, freeing and reusing\n", image_type, candidate_seq, img_idx);
    *img_idx = candidate_idx;
    return oepl_nvm_erase_image(candidate_idx);
  }

  // If we exited the for loop, we haven't found an open slot
  return NVM_NOT_FOUND;
}

oepl_nvm_status_t oepl_nvm_evict_oldest_image(size_t* img_idx)
{
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  bool found = false;
  size_t oldest_idx = 0;
  size_t oldest_seq = 0;

  for(size_t i = 0; i < num_slots; i++) {
    oepl_stored_image_hdr_t imgmeta;
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, &imgmeta, sizeof(imgmeta));
    if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      *img_idx = i;
      return NVM_SUCCESS;
    } else if(nvm_status != ECODE_NVM3_OK) {
      return NVM_ERROR;
    } else if(!imgmeta.is_valid) {
      *img_idx = i;
      return oepl_nvm_erase_image(i);
    } else if(!found || imgmeta.seqno < oldest_seq) {
      oldest_idx = i;
      oldest_seq = imgmeta.seqno;
      found = true;
    }
  }

  if(!found) {
    return NVM_NOT_FOUND;
  }

  *img_idx = oldest_idx;
  DPRINTF("Evicting oldest image (seq 0x%x) from slot 0x%x\n", (unsigned)oldest_seq, (unsigned)oldest_idx);
  return oepl_nvm_erase_image(oldest_idx);
}

oepl_nvm_status_t oepl_nvm_erase_image(size_t img_idx)
{
  DPRINTF("Erasing image at idx 0x%x\n", img_idx);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  // Erase the slot in bulk storage first
  int32_t btl_status;
  oepl_hw_flash_wake();
  if((btl_status = oepl_nvm_btl_init_with_wake()) != BOOTLOADER_OK) {
    DPRINTF("Failed BTL init with %08lx\n", btl_status);
    uint32_t addr = devconfig.bulk_storage_base_address + img_idx * slot_size;
    if(!oepl_flash_erase_range(addr, slot_size)) {
      DPRINTF("HAL erase fallback failed for slot 0x%x\n", (unsigned)img_idx);
      retval = NVM_ERROR;
      goto exit;
    }
    DPRINTF("HAL erase fallback OK for slot 0x%x\n", (unsigned)img_idx);
  } else {
    btl_status = bootloader_eraseRawStorage(devconfig.bulk_storage_base_address + img_idx * slot_size, slot_size);
    if(btl_status != BOOTLOADER_OK) {
      goto done;
    }
  }

  // Then erase the accompanying metadata
  Ecode_t nvm_status = nvm3_deleteObject(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx);
  if(nvm_status == ECODE_NVM3_OK ||
     nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    retval = NVM_SUCCESS;
  } else {
    retval = NVM_ERROR;
  }

  done:
  if(btl_status == BOOTLOADER_OK) {
    bootloader_deinit();
  }
  exit:
  oepl_hw_flash_deepsleep();
  if(btl_status != BOOTLOADER_OK && retval != NVM_SUCCESS) {
    return NVM_ERROR;
  } else {
    return retval;
  }
}

oepl_nvm_status_t oepl_nvm_erase_image_cache(uint8_t image_type)
{
  DPRINTF("Erasing cached images of type 0x%x\n", image_type);
  size_t highest_idx, highest_seqno;

  oepl_nvm_status_t retval = oepl_nvm_get_image_by_type(image_type, &highest_idx, &highest_seqno);
  if(retval == NVM_NOT_FOUND) {
    return NVM_SUCCESS;
  } else if(retval != NVM_SUCCESS) {
    return retval;
  }
  
  size_t num_slots, slot_size;
  retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  for(size_t i = 0; i < num_slots; i++) {
    oepl_stored_image_hdr_t imgmeta;
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, &imgmeta, sizeof(imgmeta));
    if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      continue;
    } else if(nvm_status != ECODE_NVM3_OK) {
      // Hardware / application error?
      return NVM_ERROR;
    } else if (i == highest_idx) {
      continue;
    } else if((imgmeta.image_type == image_type) && (imgmeta.seqno != highest_seqno)) {
      // Clean up and release this slot back for use, as it is not the most recent image
      retval = oepl_nvm_erase_image(i);
      if(retval != NVM_SUCCESS) {
        return retval;
      }
    }
  }

