abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
  return NVM_SUCCESS;
}

oepl_nvm_status_t oepl_nvm_write_image_metadata(size_t img_idx, oepl_stored_image_hdr_t* metadata)
{
  DPRINTF("Writing metadata for image idx 0x%x\n", img_idx);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  uint32_t type;
  size_t len;
  Ecode_t nvm_status = nvm3_getObjectInfo(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx, &type, &len);

  if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    // We're setting a new image. Track sequence number if another one of the same type exists.
    size_t existing_idx, existing_seq;
    if(oepl_nvm_get_image_by_type(metadata->image_type, &existing_idx, &existing_seq) == NVM_SUCCESS) {
      metadata->seqno = existing_seq + 1;
    }
  } else if(nvm_status == ECODE_NVM3_OK) {
    // We're updating or overwriting an existing object. Ensure we keep the sequence number the same.
    oepl_stored_image_hdr_t existing_image;
    retval = oepl_nvm_read_image_metadata(img_idx, &existing_image);
    if(retval != NVM_SUCCESS) {
      return retval;
    }
    if(metadata->md5 == existing_image.md5 && metadata->size == existing_image.size) {
      metadata->seqno = existing_image.seqno;
    }
  } else {
    // Hardware / application error?
    return NVM_ERROR;
  }

  nvm_status = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx, metadata, sizeof(oepl_stored_image_hdr_t));

  return nvm_status == ECODE_NVM3_OK ? NVM_SUCCESS : NVM_ERROR;
}

oepl_nvm_status_t oepl_nvm_read_image_metadata(size_t img_idx, oepl_stored_image_hdr_t* metadata)
{
  DPRINTF("Requesting metadata for image at idx 0x%x\n", img_idx);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx, metadata, sizeof(oepl_stored_image_hdr_t));

  return nvm_status == ECODE_NVM3_OK ? NVM_SUCCESS : NVM_ERROR;
}

oepl_nvm_status_t oepl_nvm_write_image_bytes(size_t img_idx, size_t offset, const uint8_t* bytes, size_t length)
{
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  int32_t btl_status;
  uint32_t addr = devconfig.bulk_storage_base_address + img_idx * slot_size + offset;
  bool written = false;

  if((btl_status = oepl_nvm_btl_init_with_wake()) == BOOTLOADER_OK) {
    DPRINTF("Write %lu to addr 0x%08lx\n", (unsigned long)length, (unsigned long)addr);
    btl_status = bootloader_writeRawStorage(addr, (uint8_t*)bytes, length);
    bootloader_deinit();
    written = (btl_status == BOOTLOADER_OK);
    if(!written) {
      DPRINTF("BTL write failed with %08lx\n", btl_status);
    }
  } else {
    DPRINTF("Failed BTL init with %08lx\n", btl_status);
  }

  if(!written) {
    if(!oepl_flash_write_range(addr, bytes, length)) {
      DPRINTF("HAL write fallback failed for slot 0x%x offset %lu\n",
              (unsigned)img_idx, (unsigned long)offset);
      oepl_hw_flash_deepsleep();
      return NVM_ERROR;
    }
    DPRINTF("HAL write fallback OK %lu bytes @ %08lx\n", (unsigned long)length, (unsigned long)addr);
  }

  oepl_hw_flash_deepsleep();
  return NVM_SUCCESS;
}

oepl_nvm_status_t oepl_nvm_read_image_bytes(size_t img_idx, size_t offset, uint8_t* bytes, size_t length)
{
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  if(length == HAL_flashRead(devconfig.bulk_storage_base_address + img_idx * slot_size + offset, bytes, length)) {
    retval = NVM_SUCCESS;
  } else {
    retval = NVM_ERROR;
  }

  return retval;
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
// Split this in a separate subroutine as the call stack blows up otherwise
static oepl_nvm_status_t check_fwu_md5(void)
{
  uint8_t read_buffer[512];
  size_t offset;
  MD5Context md5;
  device_fwu_meta_t meta;
  oepl_nvm_status_t retval = NVM_SUCCESS;
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status != ECODE_NVM3_OK) {
    DPRINTF("No staged upgrade found in NVM\n");
    return NVM_ERROR;
  }
  if(meta.staged_version == 0 || meta.staged_size == 0) {
    DPRINTF("No staged upgrade info found\n");
    return NVM_NOT_FOUND;
  }

  oepl_hw_flash_wake();

  size_t read_size = meta.staged_size - 0 > sizeof(read_buffer) ? sizeof(read_buffer) : meta.staged_size - offset;
  DPRINTF("Verifying MD5 on %d bytes in chunks of %d\n", meta.staged_size, read_size);
  md5Init(&md5);
  for(size_t offset = 0; offset < meta.staged_size;) {
    read_size = meta.staged_size - offset > sizeof(read_buffer) ? sizeof(read_buffer) : meta.staged_size - offset;
    if(read_size != HAL_flashRead(offset, read_buffer, read_size)) {
      DPRINTF("Failed FWU read\n");
      retval = NVM_ERROR;
      goto exit;
    }
    md5Update(&md5, read_buffer, read_size);
    offset += read_size;
  }
  md5Finalize(&md5);

  if(memcmp(&md5.digest[0], &meta.staged_md5, sizeof(meta.staged_md5) != 0)) {
    DPRINTF("MD5 failed, got [ ");
    for(size_t i = 0; i < 8; i++) {
      DPRINTF("%02X", md5.digest[i]);
    }
    DPRINTF(" ] expected [ ");
    for(size_t i = 0; i < 8; i++) {
      DPRINTF("%02X", ((uint8_t*)&meta.staged_md5)[i]);
    }
    retval = NVM_NOT_FOUND;
    goto exit;
  }
  exit:
  oepl_hw_flash_deepsleep();
  return retval;
}
